<?xml version="1.0" encoding="UTF-8"?>

<!-- This is an automatically generated file. -->
<Chapter Label="Chapter_Graphs_for_Premaniplexes">
<Heading>Graphs for Premaniplexes</Heading>

<Section Label="Chapter_Graphs_for_Premaniplexes_Section_Constructors_of_Premaniplexes">
<Heading>Constructors of Premaniplexes</Heading>

<ManSection>
  <Oper Arg="g" Name="Premaniplex" Label="for IsGroup"/>
 <Returns><Code>IsPremaniplex</Code>.
</Returns>
 <Description>
Given a group <A>g</A> we return the premaniplex with connection group <A>g</A>.
 This function first checks whether <A>group</A> is an Sggi. Use <Code>PremaniplexNC</Code> to
 bypass that check.
 </Description>
</ManSection>


 Here we build a premaniplex with 3 flags.
<Example><![CDATA[
gap> g:=Group((1,2),(2,3),(1,2));;
gap> Premaniplex(g);
Premaniplex of rank 3 with 3 flags
]]></Example>


<ManSection>
  <Oper Arg="G" Name="Premaniplex" Label="for IsEdgeLabeledGraph"/>
 <Returns><Code>IsPremaniplex</Code>.
</Returns>
 <Description>
Given an edge labeled graph <A>G</A> we return the premaniplex with that graph.
 Note: We will assume (but not check) that the graph is a premaniplex, that is to say, we are assumging each vertex is incident with one edge of each label.
 </Description>
</ManSection>


 Here we have a premaniplex with 2 flags.
<Example><![CDATA[
gap> gap> L:=[[[1,2],0], [[1,2],1], [[1],2], [[2],2]];;
gap> F:=EdgeLabeledGraphFromLabeledEdges(L);;
gap> Premaniplex(F);
Premaniplex of rank 3 with 2 flags
]]></Example>


<ManSection>
  <Oper Arg="n" Name="STG1" Label="for IsInt"/>
 <Returns>premaniplex
</Returns>
 <Description>
Builds the 1 flag premaniplex of rank <A>n</A>.
 See VOLTAGE OPERATIONS ON MANIPLEXES (citation coming soon).
 </Description>
</ManSection>


<Example><![CDATA[
gap> STG1(5);
Premaniplex of rank 5 with 1 flag
]]></Example>


<ManSection>
  <Oper Arg="n, I" Name="STG2" Label="for IsInt,IsList"/>
 <Returns>premaniplex
</Returns>
 <Description>
Builds the 2 flag premaniplex of rank <A>n</A> with semi-edges in <A>I</A>.
 See VOLTAGE OPERATIONS ON MANIPLEXES (citation coming soon).
 </Description>
</ManSection>


<Example><![CDATA[
gap> STG2(5,[2,4]);
Premaniplex of rank 5 with 2 flags
]]></Example>


<ManSection>
  <Oper Arg="n, i" Name="STG3" Label="for IsInt,IsInt"/>
 <Returns>premaniplex
</Returns>
 <Description>
Builds the 3 flag premaniplex of rank <A>n</A> described on Page 11 of Symmetry Type Graphs of Polytopes and Maniplexes <Cite Key="CDHT15"/> (<URL>https://doi.org/10.1007/s00026-015-0263-z</URL>). The edges of label i-1 and i+1 are parallel.
 </Description>
</ManSection>


<Example><![CDATA[
gap> STG3(5,2);
Premaniplex of rank 5 with 3 flags
]]></Example>


<ManSection>
  <Oper Arg="n, i, j" Name="STG3" Label="for IsInt,IsInt,IsInt"/>
 <Returns>premaniplex
</Returns>
 <Description>
Assumes <Code>j=i+1</Code> and builds the 3 flag premaniplex of rank <A>n</A> described on Page 11 of Symmetry Type Graphs of Polytopes and Maniplexes <Cite Key="CDHT15"/> (<URL>https://doi.org/10.1007/s00026-015-0263-z</URL>). There are edges of label <A>i</A> and <A>j</A>.
 </Description>
</ManSection>


<Example><![CDATA[
gap> STG3(6,2,3);
Premaniplex of rank 6 with 3 flags
]]></Example>


<ManSection>
  <Oper Arg="M" Name="FlagGraph" Label="for IsPremaniplex"/>
 <Returns>edgelabeledgraph
</Returns>
 <Description>
Returns the flag graph of a premaniplex <A>M</A>.
 </Description>
</ManSection>


<Example><![CDATA[
gap> STG3(4,1);;
 gap> FlagGraph(last);
Edge labeled graph with 3 vertices, and edge labels [ 0, 1, 2, 3 ]
]]></Example>


<ManSection>
  <Attr Arg="M" Name="LabeledDarts" Label="for IsPremaniplex"/>
 <Returns>list
</Returns>
 <Description>
Given a Premaniplex <A>M</A>, returns the list of labeled darts from its flag graph.
 </Description>
</ManSection>


<Example><![CDATA[
gap> P:=STG2(5,[2,4]);;
gap> LabeledDarts(P);
[ [ [ 1, 2 ], 0 ], [ [ 2, 1 ], 0 ], [ [ 1, 2 ], 1 ], [ [ 2, 1 ], 1 ], [ [ 1 ], 2 ], [ [ 1, 2 ], 3 ], [ [ 2, 1 ], 3 ], [ [ 1 ], 4 ], [ [ 2 ], 2 ], [ [ 2 ], 4 ] ]
]]></Example>


</Section>


</Chapter>

